In [1]:
import mysql.connector
import pandas as pd

In [2]:
mydb = mysql.connector.connect(
    host = 'localhost',    
    user = 'manel',
    password = 'itacademy',
    database="mydb")

mycursor = mydb.cursor()
mycursor

In [3]:
sql_query = 'SHOW TABLES'
mycursor.execute(sql_query)

for x in mycursor:
  print(x)

('Sale',)
('contains_hidden_trait',)
('contains_trait',)
('hidden_trait',)
('punk',)
('skin',)
('trait',)
('type',)

In [89]:
# join both tables and
sql_query = '''SELECT t.name,c_t.punk_id from trait AS t 
            LEFT JOIN contains_trait AS c_t
            ON t.id = c_t.trait_id
            ;'''


df = pd.read_sql_query(sql_query,mydb)

df

                   name  punk_id
0            Blonde Bob     8680
1            Blonde Bob     8636
2            Blonde Bob     8539
3            Blonde Bob     8529
4            Blonde Bob     8506
...                 ...      ...
27534  Front Beard Dark     8853
27535  Front Beard Dark     8798
27536  Front Beard Dark     8761
27537  Front Beard Dark     8753
27538  Front Beard Dark     8720

[27539 rows x 2 columns]

In [91]:
# join both tables and
sql_query = '''SELECT p.rarity,p.total_traits,new.name 
            FROM punk AS p
            JOIN 
            (SELECT t.name,c_t.punk_id from trait AS t 
            LEFT JOIN contains_trait AS c_t
            ON t.id = c_t.trait_id) AS new
            ON p.id = new.punk_id
            ;'''


df = pd.read_sql_query(sql_query,mydb)

df

       rarity  total_traits              name
0        2023             3            Mohawk
1        2023             3             Smile
2        4352             2         Wild Hair
3        8090             1         Wild Hair
4        8090             1      Nerd Glasses
...       ...           ...               ...
27531     498             2   Wild White Hair
27532     498             2    Black Lipstick
27533     498             2  Clown Eyes Green
27534    1271             3            Mohawk
27535    1271             3      Nerd Glasses

[27536 rows x 3 columns]

In [32]:
df.rarity.sort_values()

22654        1
22655        1
22656        1
17275        2
17274        2
         ...
935       9999
934       9999
2402     10000
2403     10000
2404     10000
Name: rarity, Length: 27536, dtype: int64